БылковДА_70180166/src/Documents/НаправлениеНаПересдачу/НаправлениеНаПересдачу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаправлениеНаПересдачу</name>
  <basedOn>Document.ИдентификацияАкадемическихЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ДатыПересдач</registerRecords>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ИдентификацияАкадемическихЗадолженностей</types>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</name>
  <basedOn>Document.НаправлениеНаПересдачу</basedOn>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РольВКомиссии</name>
    <type>
      <types>EnumRef.РольВКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.НаправлениеНаПересдачу</types>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийБилет</name>
    <type>
      <types>CatalogRef.СтуденческиеБилеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>EnumRef.Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансирования</name>
    <type>
      <types>EnumRef.ВидыФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРасмотрения</name>
    <type>
      <types>EnumRef.СтатусРассмотрения</types>
    </type>
  </attributes>
</mdclass:Catalog>

БылковДА_70180166/src/Documents/НаправлениеНаПересдачу/ObjectModule.bsl
&НаСервере
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИдентификацияАкадемическихЗадолженностей") Тогда
        // Заполнение шапки документа
        ЭтотОбъект.Группа = ДанныеЗаполнения.Группа;
        ЭтотОбъект.ЛичныйИндекс = ДанныеЗаполнения.ЛичныйИндекс;
        ЭтотОбъект.НаправленияПодготовки = ДанныеЗаполнения.НаправленияПодготовки;
        ЭтотОбъект.Студент = ДанныеЗаполнения.Студент;
        ЭтотОбъект.Факультет = ДанныеЗаполнения.Факультет;
        ЭтотОбъект.ФормаОбучения = ДанныеЗаполнения.ФормаОбучения;
        ЭтотОбъект.Основание = ДанныеЗаполнения.Ссылка;
        ЭтотОбъект.Курс = ПолучитьКурсСтудента(ДанныеЗаполнения.Студент);
        
        // Получаем объект документа-основания
        ДокументОснование = ДанныеЗаполнения.ПолучитьОбъект();
                
        // Проверяем наличие записей в табличной части документа-основания
        Если ДокументОснование.Характеристика.Количество() > 0 Тогда
            // Для ввода на основании (не множественное создание) берем первую строку
            ПерваяСтрока = ДокументОснование.Характеристика[0];
            ЭтотОбъект.Дисциплина = ПерваяСтрока.Дисциплины;
            ЭтотОбъект.НаименованиеКонтроля = ПерваяСтрока.НаименованиеКонтроля;
            
            // Проверяем наличие табличной части Характеристика в текущем документе
            Если Метаданные.Документы[ЭтотОбъект.Метаданные().Имя].ТабличныеЧасти.Найти("Характеристика") <> Неопределено Тогда
                ЭтотОбъект.Характеристика.Очистить();
                НоваяСтрока = ЭтотОбъект.Характеристика.Добавить();
                НоваяСтрока.Дисциплины = ПерваяСтрока.Дисциплины;
                НоваяСтрока.НаименованиеКонтроля = ПерваяСтрока.НаименованиеКонтроля;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры   


&НаСервере
Функция ПолучитьКурсСтудента(СсылкаНаСтудента) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Студенты.Курс КАК Курс
    |ИЗ
    |    Справочник.Студенты КАК Студенты
    |ГДЕ
    |    Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Курс;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ОткрытьСозданныеНаправления(МассивСсылок) Экспорт
    // Открываем все документы в одном списке с отбором
    ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить("Ссылка", МассивСсылок);
    ОткрытьФорму("Список.НаправлениеНаПересдачу", ПараметрыОтбора);
    
    Сообщить("Создано " + МассивСсылок.Количество() + " документов НаправлениеНаПересдачу.");
КонецПроцедуры

&НаСервере
Функция СоздатьПриказИзНаправлений() Экспорт
    НовыйПриказ = Документы.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.СоздатьДокумент();
    
    // Заполняем общие реквизиты приказа
    НовыйПриказ.Дата = ТекущаяДата();
    НовыйПриказ.Номер = "";
    НовыйПриказ.Курс = ЭтотОбъект.Курс;
    
    // Получаем все направления для данного студента
    ВыборкаНаправлений = Документы.НаправлениеНаПересдачу.ВыбратьПоРеквизиту("Студент", ЭтотОбъект.Студент);
    
    Пока ВыборкаНаправлений.Следующий() Цикл
        Направление = ВыборкаНаправлений.ПолучитьОбъект();
        
        // Добавляем дисциплину в приказ
        НовыйЭлементПриказ = НовыйПриказ.Элементы.Добавить();
        НовыйЭлементПриказ.Дисциплина = Направление.Дисциплина;
        НовыйЭлементПриказ.НаименованиеКонтроля = Направление.НаименованиеКонтроля;
        НовыйЭлементПриказ.Студент = Направление.Студент;
        НовыйЭлементПриказ.Группа = Направление.Группа;
        НовыйЭлементПриказ.Курс = Направление.Курс;
        НовыйЭлементПриказ.ДатаПересдачи = Направление.ДатаПроведения;
    КонецЦикла;

    НовыйПриказ.Записать();
    
    // Возвращаем ссылку для открытия на клиенте
    Возврат НовыйПриказ.Ссылка;
КонецФункции

&НаКлиенте
Процедура СоздатьНаправленияНаКлиенте(Команда) Экспорт
    Если Модифицированность Тогда
        Вопрос = Новый ОписаниеОповещения("ПослеВопросаОЗаписи", ЭтотОбъект);
        ПоказатьВопрос(Вопрос, "Документ был изменен. Сохранить изменения перед созданием направлений?", РежимДиалогаВопрос.ДаНетОтмена);
    Иначе
        СоздатьИОткрытьНаправления();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСозданныеНаправления(МассивСсылок) Экспорт
    Если МассивСсылок.Количество() > 0 Тогда
        ПараметрыОтбора = Новый Структура;
        ПараметрыОтбора.Вставить("Ссылка", МассивСсылок);
        ОткрытьФорму("Список.НаправлениеНаПересдачу", ПараметрыОтбора);
        Сообщить("Создано " + МассивСсылок.Количество() + " документов НаправлениеНаПересдачу.");
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ДатыПересдач.Записывать = Истина;
	Движение = Движения.ДатыПересдач.Добавить();
	Движение.Преподаватель = Преподаватель;
	Движение.Аудитория = Аудитория;
	Движение.Дисциплина = Дисциплина;
	Движение.ДатаВыдачи = Дата;
	Движение.ДатаПересдачи = ДатаПроведения;

КонецПроцедуры
